tests/test_03_liu2020/cases/A2_Q20to100_openchannel_nogeyser/openfoam/3d/case/0.orig/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        // Apply Q only over the instantaneous wet fraction of the reported
        // pipe-end section.  This removes the former unreported headbox.
        type            variableHeightFlowRateInletVelocity;
        flowRate table
        (
            (-12.0 0.020)
            ( 0.0  0.020)
            ( 0.4  0.100)
            (14.4  0.100)
        );
        alpha           alpha.water;
        value           uniform (0 0 0);
    }
    tankAtmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    riserOutlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    weirOutlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    solidWalls
    {
        type            noSlip;
    }
    solidRiserWall
    {
        type            noSlip;
    }
}