tests/test_03_liu2020/cases/A2_Q20to100_openchannel_nogeyser/openfoam/3d/case/0.orig/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    tankAtmosphere
    {
        type            calculated;
        value           uniform 0;
    }
    riserOutlet
    {
        type            calculated;
        value           uniform 0;
    }
    weirOutlet
    {
        type            calculated;
        value           uniform 0;
    }
    solidWalls
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    solidRiserWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}