tests/test_03_liu2020/cases/A2_Q20to100_openchannel_nogeyser/openfoam/3d/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          149;
        startFace       478116;
    }
    riserOutlet
    {
        type            patch;
        physicalType    patch;
        nFaces          72;
        startFace       478265;
    }
    tankAtmosphere
    {
        type            patch;
        physicalType    patch;
        nFaces          732;
        startFace       478337;
    }
    weirOutlet
    {
        type            patch;
        physicalType    patch;
        nFaces          142;
        startFace       479069;
    }
    solidWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          44419;
        startFace       479211;
    }
    solidRiserWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4910;
        startFace       523630;
    }
)

// ************************************************************************* //
