tests/test_03_liu2020/cases/A2_Q20to100_openchannel_nogeyser/openfoam/3d/case/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  RAS;

RAS
{
    RASModel        kOmegaSST;
    turbulence      on;
    printCoeffs     on;

    // Prevent k/omega underflow in the large initially quiescent air volume
    // of the receiving tank.  These floors imply at most O(1e-6 m2/s)
    // background nut and do not calibrate hydraulic losses or pressures.
    kMin           1e-12;
    omegaMin       1e-6;
}
