tests/test_03_liu2020/cases/A2_Q20to100_openchannel_nogeyser/openfoam/3d/case/system/boreProbeLocations
// generated by ../prepare_runtime.py; station-major, five points/station
            (-0.30000 0.00000 0.28300) (-0.30000 0.03000 0.28300) (-0.30000 -0.03000 0.28300) (-0.30000 0.00000 0.30300) (-0.30000 0.00000 0.32300) (-0.01000 0.00000 0.28010) (-0.01000 0.03000 0.28010) (-0.01000 -0.03000 0.28010) (-0.01000 0.00000 0.30010) (-0.01000 0.00000 0.32010)
