tests/test_03_liu2020/cases/A2_Q20to100_openchannel_nogeyser/openfoam/3d/case/system/createPatchDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

pointSync false;

patches
(
    {
        name            solidWalls;
        patchInfo       { type wall; }
        constructFrom   patches;
        patches         (walls);
    }
    {
        name            solidRiserWall;
        patchInfo       { type wall; }
        constructFrom   patches;
        patches         (riserWall);
    }
);
