tests/test_03_liu2020/cases/A2_Q20to100_openchannel_nogeyser/openfoam/3d/case/system/fvOptions
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}

// guard against single-cell velocity singularities (sliver cells at the
// pipe-wall junction lips): physical velocities in this rig stay < 5 m/s,
// the cap only ever acts on degenerate cells
limitU
{
    type            limitVelocity;
    active          yes;
    selectionMode   all;
    max             10.0;
}
