tests/test_03_liu2020/cases/A2_Q20to100_openchannel_nogeyser/openfoam/3d/case/system/riserProbeLocations
// generated by ../prepare_runtime.py; level-major, five points/level
            (0.15000 0.00000 0.46000) (0.16500 0.00000 0.46000) (0.13500 0.00000 0.46000) (0.15000 0.01500 0.46000) (0.15000 -0.01500 0.46000)
            (0.15000 0.00000 0.48000) (0.16500 0.00000 0.48000) (0.13500 0.00000 0.48000) (0.15000 0.01500 0.48000) (0.15000 -0.01500 0.48000)
            (0.15000 0.00000 0.50000) (0.16500 0.00000 0.50000) (0.13500 0.00000 0.50000) (0.15000 0.01500 0.50000) (0.15000 -0.01500 0.50000)
            (0.15000 0.00000 0.52000) (0.16500 0.00000 0.52000) (0.13500 0.00000 0.52000) (0.15000 0.01500 0.52000) (0.15000 -0.01500 0.52000)
            (0.15000 0.00000 0.54000) (0.16500 0.00000 0.54000) (0.13500 0.00000 0.54000) (0.15000 0.01500 0.54000) (0.15000 -0.01500 0.54000)
            (0.15000 0.00000 0.56000) (0.16500 0.00000 0.56000) (0.13500 0.00000 0.56000) (0.15000 0.01500 0.56000) (0.15000 -0.01500 0.56000)
            (0.15000 0.00000 0.58000) (0.16500 0.00000 0.58000) (0.13500 0.00000 0.58000) (0.15000 0.01500 0.58000) (0.15000 -0.01500 0.58000)
            (0.15000 0.00000 0.60000) (0.16500 0.00000 0.60000) (0.13500 0.00000 0.60000) (0.15000 0.01500 0.60000) (0.15000 -0.01500 0.60000)
            (0.15000 0.00000 0.62000) (0.16500 0.00000 0.62000) (0.13500 0.00000 0.62000) (0.15000 0.01500 0.62000) (0.15000 -0.01500 0.62000)
            (0.15000 0.00000 0.64000) (0.16500 0.00000 0.64000) (0.13500 0.00000 0.64000) (0.15000 0.01500 0.64000) (0.15000 -0.01500 0.64000)
            (0.15000 0.00000 0.66000) (0.16500 0.00000 0.66000) (0.13500 0.00000 0.66000) (0.15000 0.01500 0.66000) (0.15000 -0.01500 0.66000)
            (0.15000 0.00000 0.68000) (0.16500 0.00000 0.68000) (0.13500 0.00000 0.68000) (0.15000 0.01500 0.68000) (0.15000 -0.01500 0.68000)
            (0.15000 0.00000 0.70000) (0.16500 0.00000 0.70000) (0.13500 0.00000 0.70000) (0.15000 0.01500 0.70000) (0.15000 -0.01500 0.70000)
            (0.15000 0.00000 0.72000) (0.16500 0.00000 0.72000) (0.13500 0.00000 0.72000) (0.15000 0.01500 0.72000) (0.15000 -0.01500 0.72000)
            (0.15000 0.00000 0.74000) (0.16500 0.00000 0.74000) (0.13500 0.00000 0.74000) (0.15000 0.01500 0.74000) (0.15000 -0.01500 0.74000)
            (0.15000 0.00000 0.76000) (0.16500 0.00000 0.76000) (0.13500 0.00000 0.76000) (0.15000 0.01500 0.76000) (0.15000 -0.01500 0.76000)
            (0.15000 0.00000 0.78000) (0.16500 0.00000 0.78000) (0.13500 0.00000 0.78000) (0.15000 0.01500 0.78000) (0.15000 -0.01500 0.78000)
            (0.15000 0.00000 0.80000) (0.16500 0.00000 0.80000) (0.13500 0.00000 0.80000) (0.15000 0.01500 0.80000) (0.15000 -0.01500 0.80000)
            (0.15000 0.00000 0.82000) (0.16500 0.00000 0.82000) (0.13500 0.00000 0.82000) (0.15000 0.01500 0.82000) (0.15000 -0.01500 0.82000)
            (0.15000 0.00000 0.84000) (0.16500 0.00000 0.84000) (0.13500 0.00000 0.84000) (0.15000 0.01500 0.84000) (0.15000 -0.01500 0.84000)
            (0.15000 0.00000 0.86000) (0.16500 0.00000 0.86000) (0.13500 0.00000 0.86000) (0.15000 0.01500 0.86000) (0.15000 -0.01500 0.86000)
            (0.15000 0.00000 0.88000) (0.16500 0.00000 0.88000) (0.13500 0.00000 0.88000) (0.15000 0.01500 0.88000) (0.15000 -0.01500 0.88000)
            (0.15000 0.00000 0.90000) (0.16500 0.00000 0.90000) (0.13500 0.00000 0.90000) (0.15000 0.01500 0.90000) (0.15000 -0.01500 0.90000)
            (0.15000 0.00000 0.92000) (0.16500 0.00000 0.92000) (0.13500 0.00000 0.92000) (0.15000 0.01500 0.92000) (0.15000 -0.01500 0.92000)
            (0.15000 0.00000 0.94000) (0.16500 0.00000 0.94000) (0.13500 0.00000 0.94000) (0.15000 0.01500 0.94000) (0.15000 -0.01500 0.94000)
            (0.15000 0.00000 0.96000) (0.16500 0.00000 0.96000) (0.13500 0.00000 0.96000) (0.15000 0.01500 0.96000) (0.15000 -0.01500 0.96000)
            (0.15000 0.00000 0.98000) (0.16500 0.00000 0.98000) (0.13500 0.00000 0.98000) (0.15000 0.01500 0.98000) (0.15000 -0.01500 0.98000)
            (0.15000 0.00000 1.00000) (0.16500 0.00000 1.00000) (0.13500 0.00000 1.00000) (0.15000 0.01500 1.00000) (0.15000 -0.01500 1.00000)
            (0.15000 0.00000 1.02000) (0.16500 0.00000 1.02000) (0.13500 0.00000 1.02000) (0.15000 0.01500 1.02000) (0.15000 -0.01500 1.02000)
            (0.15000 0.00000 1.04000) (0.16500 0.00000 1.04000) (0.13500 0.00000 1.04000) (0.15000 0.01500 1.04000) (0.15000 -0.01500 1.04000)
            (0.15000 0.00000 1.06000) (0.16500 0.00000 1.06000) (0.13500 0.00000 1.06000) (0.15000 0.01500 1.06000) (0.15000 -0.01500 1.06000)
            (0.15000 0.00000 1.08000) (0.16500 0.00000 1.08000) (0.13500 0.00000 1.08000) (0.15000 0.01500 1.08000) (0.15000 -0.01500 1.08000)
            (0.15000 0.00000 1.10000) (0.16500 0.00000 1.10000) (0.13500 0.00000 1.10000) (0.15000 0.01500 1.10000) (0.15000 -0.01500 1.10000)
            (0.15000 0.00000 1.12000) (0.16500 0.00000 1.12000) (0.13500 0.00000 1.12000) (0.15000 0.01500 1.12000) (0.15000 -0.01500 1.12000)
            (0.15000 0.00000 1.14000) (0.16500 0.00000 1.14000) (0.13500 0.00000 1.14000) (0.15000 0.01500 1.14000) (0.15000 -0.01500 1.14000)
            (0.15000 0.00000 1.16000) (0.16500 0.00000 1.16000) (0.13500 0.00000 1.16000) (0.15000 0.01500 1.16000) (0.15000 -0.01500 1.16000)
            (0.15000 0.00000 1.18000) (0.16500 0.00000 1.18000) (0.13500 0.00000 1.18000) (0.15000 0.01500 1.18000) (0.15000 -0.01500 1.18000)
            (0.15000 0.00000 1.20000) (0.16500 0.00000 1.20000) (0.13500 0.00000 1.20000) (0.15000 0.01500 1.20000) (0.15000 -0.01500 1.20000)
            (0.15000 0.00000 1.22000) (0.16500 0.00000 1.22000) (0.13500 0.00000 1.22000) (0.15000 0.01500 1.22000) (0.15000 -0.01500 1.22000)
            (0.15000 0.00000 1.24000) (0.16500 0.00000 1.24000) (0.13500 0.00000 1.24000) (0.15000 0.01500 1.24000) (0.15000 -0.01500 1.24000)
            (0.15000 0.00000 1.26000) (0.16500 0.00000 1.26000) (0.13500 0.00000 1.26000) (0.15000 0.01500 1.26000) (0.15000 -0.01500 1.26000)
            (0.15000 0.00000 1.28000) (0.16500 0.00000 1.28000) (0.13500 0.00000 1.28000) (0.15000 0.01500 1.28000) (0.15000 -0.01500 1.28000)
            (0.15000 0.00000 1.30000) (0.16500 0.00000 1.30000) (0.13500 0.00000 1.30000) (0.15000 0.01500 1.30000) (0.15000 -0.01500 1.30000)
            (0.15000 0.00000 1.32000) (0.16500 0.00000 1.32000) (0.13500 0.00000 1.32000) (0.15000 0.01500 1.32000) (0.15000 -0.01500 1.32000)
            (0.15000 0.00000 1.34000) (0.16500 0.00000 1.34000) (0.13500 0.00000 1.34000) (0.15000 0.01500 1.34000) (0.15000 -0.01500 1.34000)
            (0.15000 0.00000 1.36000) (0.16500 0.00000 1.36000) (0.13500 0.00000 1.36000) (0.15000 0.01500 1.36000) (0.15000 -0.01500 1.36000)
            (0.15000 0.00000 1.38000) (0.16500 0.00000 1.38000) (0.13500 0.00000 1.38000) (0.15000 0.01500 1.38000) (0.15000 -0.01500 1.38000)
            (0.15000 0.00000 1.40000) (0.16500 0.00000 1.40000) (0.13500 0.00000 1.40000) (0.15000 0.01500 1.40000) (0.15000 -0.01500 1.40000)
            (0.15000 0.00000 1.42000) (0.16500 0.00000 1.42000) (0.13500 0.00000 1.42000) (0.15000 0.01500 1.42000) (0.15000 -0.01500 1.42000)
            (0.15000 0.00000 1.44000) (0.16500 0.00000 1.44000) (0.13500 0.00000 1.44000) (0.15000 0.01500 1.44000) (0.15000 -0.01500 1.44000)
            (0.15000 0.00000 1.46000) (0.16500 0.00000 1.46000) (0.13500 0.00000 1.46000) (0.15000 0.01500 1.46000) (0.15000 -0.01500 1.46000)
            (0.15000 0.00000 1.48000) (0.16500 0.00000 1.48000) (0.13500 0.00000 1.48000) (0.15000 0.01500 1.48000) (0.15000 -0.01500 1.48000)
            (0.15000 0.00000 1.50000) (0.16500 0.00000 1.50000) (0.13500 0.00000 1.50000) (0.15000 0.01500 1.50000) (0.15000 -0.01500 1.50000)
            (0.15000 0.00000 1.52000) (0.16500 0.00000 1.52000) (0.13500 0.00000 1.52000) (0.15000 0.01500 1.52000) (0.15000 -0.01500 1.52000)
            (0.15000 0.00000 1.54000) (0.16500 0.00000 1.54000) (0.13500 0.00000 1.54000) (0.15000 0.01500 1.54000) (0.15000 -0.01500 1.54000)
            (0.15000 0.00000 1.56000) (0.16500 0.00000 1.56000) (0.13500 0.00000 1.56000) (0.15000 0.01500 1.56000) (0.15000 -0.01500 1.56000)
            (0.15000 0.00000 1.58000) (0.16500 0.00000 1.58000) (0.13500 0.00000 1.58000) (0.15000 0.01500 1.58000) (0.15000 -0.01500 1.58000)
            (0.15000 0.00000 1.60000) (0.16500 0.00000 1.60000) (0.13500 0.00000 1.60000) (0.15000 0.01500 1.60000) (0.15000 -0.01500 1.60000)
            (0.15000 0.00000 1.62000) (0.16500 0.00000 1.62000) (0.13500 0.00000 1.62000) (0.15000 0.01500 1.62000) (0.15000 -0.01500 1.62000)
            (0.15000 0.00000 1.64000) (0.16500 0.00000 1.64000) (0.13500 0.00000 1.64000) (0.15000 0.01500 1.64000) (0.15000 -0.01500 1.64000)
            (0.15000 0.00000 1.66000) (0.16500 0.00000 1.66000) (0.13500 0.00000 1.66000) (0.15000 0.01500 1.66000) (0.15000 -0.01500 1.66000)
