tests/test_03_liu2020/cases/A2_Q20to100_openchannel_nogeyser/openfoam/3d/case/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

// Paper-consistent initial water:
//   upstream depth ~0.08 m (p. 04019055-3);
//   chamber free surface z=0.12 m, inferred from PT3=0.99 kPa at z=0.02 m;
//   downstream depth hd=Dd/4=0.070 m (Table 1).
// The Liu (2018) thesis adds the 0.57 x 0.61 x 0.89 m receiving tank and
// 0.30 m diameter, 0.40 m high overflow weir used in the same experiment.
// Six boxes approximate the upstream 1:100 free surface.  The -12..0 s Q0
// interval establishes the experimental steady initial flow before the ramp.

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volScalarFieldValue p_rgh 0
    volVectorFieldValue U (0 0 0)
);

regions
(
    // Upstream pipe: invert z=0.18-0.01*x, depth ~0.08 m.
    // The 0.08 m circular-segment area is 0.011735 m2, so Q0/A=1.704 m/s.
    boxToCell { box (-5.82 -1 -1) (-4.83 1 0.3132);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue p_rgh 3072
            volVectorFieldValue U (1.70425 0 -0.0170425)
        ); }
    boxToCell { box (-4.83 -1 -1) (-3.87 1 0.3035);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue p_rgh 2977
            volVectorFieldValue U (1.70425 0 -0.0170425)
        ); }
    boxToCell { box (-3.87 -1 -1) (-2.90 1 0.2939);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue p_rgh 2883
            volVectorFieldValue U (1.70425 0 -0.0170425)
        ); }
    boxToCell { box (-2.90 -1 -1) (-1.93 1 0.2842);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue p_rgh 2788
            volVectorFieldValue U (1.70425 0 -0.0170425)
        ); }
    boxToCell { box (-1.93 -1 -1) (-0.97 1 0.2745);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue p_rgh 2693
            volVectorFieldValue U (1.70425 0 -0.0170425)
        ); }
    boxToCell { box (-0.97 -1 -1) ( 0.00 1 0.2649);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue p_rgh 2599
            volVectorFieldValue U (1.70425 0 -0.0170425)
        ); }

    // junction chamber
    boxToCell { box (0.00 -1 -1) (0.30 1 0.12);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue p_rgh 1177
        ); }

    // Downstream pipe (invert z=0), paper target hd/Dd=1/4.
    // The 0.070 m circular-segment area is 0.012038 m2, so Q0/A=1.661 m/s.
    boxToCell { box (0.30 -1 -1) (6.25 1 0.070);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue p_rgh 687
            volVectorFieldValue U (1.66140 0 0)
        ); }

    // Receiving tank initial stage.  The movable circular weir crest is
    // z=0.031 m, calibrated only to pass Q0 at the reported hd=0.070 m.
    boxToCell { box (6.249 -0.306 -0.370) (6.821 0.306 0.070);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue p_rgh 687
        ); }

    // Start the overflow-weir bore with air; Q0 establishes the falling nappe
    // and drain flow during the pre-ramp interval.
    cylinderToCell
    {
        point1 (6.535 0 -0.370);
        point2 (6.535 0  0.070);
        radius 0.140;
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue p_rgh 0
            volVectorFieldValue U (0 0 0)
        );
    }
);
