tests/test_03_liu2020/cases/A2_Q20to100_openchannel_nogeyser/openfoam/3d/case/system/tankProbeLocations
// generated by ../prepare_runtime.py; receiving-tank vertical stage line
...
